---
kind: type
id: T:Autodesk.Revit.DB.Lighting.LightDistributionStyle
source: html/54a4212a-9694-5032-bdc4-a7cc0603f0e1.htm
---
# Autodesk.Revit.DB.Lighting.LightDistributionStyle

Tags for specific light distribution styles

## Syntax (C#)
```csharp
public enum LightDistributionStyle
```